<?php
    // Обычные свойства и методы они описаны в классе и принадлежат они объекту.
    // Статические свойтсва и методы также описаны в классе, но принадлежат они не объекту, а классу.

    // Вызывать обычные свойства и методы можем в контексте объекта, если работаем в классе, то
    // через $this. А если мы работаем вне класса, то через созданный экземпляр класса, через объект.

    // Статические свойства и методы вызываются в классе через self. Вне класса через наименование класса,
    // не через объект.

    // const - постоянные свойства, внутри класса вызываются через self. Вне класса через имя класса.

    require_once 'classes/Product.php';

    function debug($data) {
        echo "<pre>" . print_r($data, 1) . "</pre>";
    }

    $book = new Product("Три мушкетера", 20, null, 1000);
    $notebook = new Product("Dell", 1000, 'Intel');

    debug($book);
    debug($notebook);

    echo $book->getProduct('book');
    echo $notebook->getProduct();
