<?php
// SQL - язык запросов БД
// MySQL - система управления БД
// `` - пишут, чтобы не было конфликтов, если случайно используешь название полей зарезервированными именами
// (чтобы воспринималось как имя а не функция)
// '' - строки, даты нужно оборачивать в кавычки 

// int - целое число
// VARCHAR - строка не большой длины (255 символов)
// TEXT - текст
// DATE - дата

// Сравнение - это кодировка
// UNSIGNED - без знака



// UPDATE `gb` SET `text` = CONCAT(text, '!') - конкатенация в MySQL
